Revit 2027 API
Application.ShowGraphicalWarningDuctDisconnects Property
 Whether or not to show the graphical warnings for duct disconnects.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGraphicalWarningDuctDisconnects { get; set; }
Public Property ShowGraphicalWarningDuctDisconnects As Boolean
	Get
	Set
public:
property bool ShowGraphicalWarningDuctDisconnects {
	bool get ();
	void set (bool value);
}
member ShowGraphicalWarningDuctDisconnects : bool with get, set
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace